brew "bat"
brew "carapace"
brew "eza"
brew "fd"
brew "fnm"
brew "fzf"
brew "gh"
brew "git"
brew "gnupg"
brew "just"
brew "neovim"
brew "nushell"
brew "starship"
brew "zlib"
brew "zoxide"
cask "arc"
cask "chatgpt"
cask "cursor"
cask "font-fira-code-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "raycast"
cask "secretive"
cask "slack"
cask "spotify"
cask "visual-studio-code"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "ionide.ionide-fsharp"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.dotnet-interactive-vscode"
vscode "ms-dotnettools.vscode-dotnet-pack"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.vscode-typescript-next"
vscode "nrwl.angular-console"
vscode "openai.chatgpt"
