tap "anomalyco/tap"
tap "microsoft/apm"

# --- Core CLI Tools (Rust-based, fast replacements) ---
brew "bat"           # Syntax-highlighted cat
brew "fd"            # Fast find alternative
brew "eza"           # Modern ls replacement
brew "fzf"           # Fuzzy finder
brew "ripgrep"       # Fast grep alternative
brew "ast-grep"      # Structural code search, linting, and rewriting
brew "zoxide"        # Smarter cd
brew "starship"      # Minimal, fast prompt
brew "carapace"      # Completion engine for CLIs

# --- Shells & Editors ---
brew "neovim"        # Terminal editor
brew "universal-ctags" # Maintained ctags implementation
cask "ghostty"       # GPU-accelerated terminal
cask "visual-studio-code" # Main GUI IDE

# --- Node.js & Package Management ---
# Homebrew installs fnm only; fnm's default Node owns Node, Corepack, and pnpm.
brew "fnm"           # Fast Node.js version manager

# --- Language, Runtime & Data Tooling ---
brew "mise"          # Strategic .NET SDK owner; SDK installs are later-gated
brew "uv"            # Fast Python package installer and resolver
brew "composer"      # PHP dependency manager
brew "mysql-client"  # MySQL client tools

# --- AWS & Cloud Development ---
brew "awscli"        # AWS CLI
brew "aws-sso-util"  # AWS SSO helper
cask "session-manager-plugin" # AWS Systems Manager Session Manager plugin
cask "leapp"         # Cloud credentials manager
cask "rider"         # .NET IDE

# --- Containers & API Development ---
brew "colima"        # macOS container runtime manager
brew "docker"        # Docker CLI
brew "docker-buildx" # Docker BuildKit CLI plugin
brew "docker-compose" # Docker Compose CLI
brew "httpie"        # HTTP API CLI client
cask "bruno"         # Git-friendly API development client

# --- Security & DevSecOps ---
brew "gitleaks"      # Secret scanning
brew "ripsecrets"    # Fast secret scanner
brew "semgrep"       # Static analysis and security scanning
brew "dotenv-linter" # Lint .env files
brew "editorconfig-checker" # Enforce EditorConfig
brew "direnv"        # Environment variable manager

# --- Documentation & Media Tooling ---
brew "graphviz"      # Graph visualization for generated diagrams
brew "poppler"       # PDF rendering and inspection utilities
brew "ffmpeg"        # Audio/video conversion utilities

# --- AI Tool Surfaces ---
brew "microsoft/apm/apm" # AI Asset Manager
brew "anomalyco/tap/opencode" # OpenCode terminal AI agent
brew "ollama"        # Local LLM runner
cask "chatgpt"       # AI assistant
cask "chatgpt-atlas" # ChatGPT browser
cask "claude"        # Claude Desktop GUI surface
cask "claude-code"   # Claude Code stable CLI surface
cask "codex"         # OpenAI Codex CLI surface

# --- Network Security & Privacy ---
brew "dnscrypt-proxy" # Encrypted DNS proxy
cask "lulu"          # macOS firewall
cask "nordvpn"       # VPN service
cask "brave-browser" # Privacy-focused browser

# --- Productivity & Utilities ---
brew "just"          # Task runner
brew "gh"            # GitHub CLI
brew "git"           # Git version control
brew "gnupg"         # GPG for signing
brew "zlib"          # Compression library
brew "topgrade"      # One command to upgrade everything
cask "caffeine"      # Prevent sleep during long-running tasks
cask "maccy"         # Clipboard manager
cask "wispr-flow"    # AI dictation and auto-editing

# --- Fonts & UI ---
cask "font-fira-code-nerd-font" # Dev font
cask "arc"           # Browser
cask "raycast"       # Productivity launcher
cask "firefox"       # Browser
cask "google-chrome" # Browser
cask "secretive"     # Secure key storage
cask "slack"         # Messaging
cask "spotify"       # Music

# --- VS Code Extensions (auto-installed) ---
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "genaiscript.genaiscript-vscode"
vscode "ionide.ionide-fsharp"
vscode "likec4.likec4-vscode"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.dotnet-interactive-vscode"
vscode "ms-dotnettools.vscode-dotnet-pack"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.vscode-typescript-next"
vscode "nrwl.angular-console"
vscode "openai.chatgpt"
